In [2]:
import pandas as pd
import numpy as np

In [2]:
a = np.arange(9)
pd.DataFrame({'a': a})

   a
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8

In [3]:
s = pd.Series([1,3,5,7,9])
print(s,'\n')
print(s.index,'\n')
print(s.values)

0    1
1    3
2    5
3    7
4    9
dtype: int64

RangeIndex(start=0, stop=5, step=1)

[1 3 5 7 9]

In [4]:
s = pd.Series([9904312,3448737,2890451,2466052], index=['서울','부산','인천','대구'])
print(s,'\n')
print(pd.Series(range(1,10)),'\n')
print(s.index,'\n')
print(s.values,'\n')
s.name = '인구'
s.index.name = '도시'

print(s,'\n')

s.index.name = None
print(s,'\n')

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

Index(['서울', '부산', '인천', '대구'], dtype='object')

[9904312 3448737 2890451 2466052]

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [5]:
s = pd.Series([9904312,3448737,2890451,2466052], index=['서울','부산','인천','대구'])
s = s / 1000000
print(s,'\n')
print(s[1:3],'\n')
print(s['서울'],'\n')

서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
dtype: float64

부산    3.448737
인천    2.890451
dtype: float64

9.904312

In [6]:
s1 = pd.Series(range(3), index=['a','b','c'])
print(s1,'\n')
print(s1.a,'\n')
print(s1['a'])

a    0
b    1
c    2
dtype: int64

0

0

In [7]:
s = pd.Series([9904312,3448737,2890451,2466052], index=['서울','부산','인천','대구'])
print('대구' in s,'\n')
print('대전' in s,'\n')
for key, value in s.items():
    print('{0},{1}'.format(key, value))

for key in s.keys():
    print('{0}'.format(key))
print(s.values)

True

False

서울,9904312
부산,3448737
인천,2890451
대구,2466052
서울
부산
인천
대구
[9904312 3448737 2890451 2466052]

In [8]:
s = pd.Series({'국어':90, '영어':80, '수학':70})
print(s,'\n')
print(s.index,'\n')
print(s.values,'\n')

s2 = pd.Series({'서울':9000000,'부산':8000000,'인천':7000000,'대전':6000000})
print(s2,'\n')
print(s2.index,'\n')
s2 = pd.Series({'서울':9000000,'부산':8000000,'인천':7000000,'대전':6000000}, index=['부산','서울','인천','대전'])
print(s2)

국어    90
영어    80
수학    70
dtype: int64

Index(['국어', '영어', '수학'], dtype='object')

[90 80 70]

서울    9000000
부산    8000000
인천    7000000
대전    6000000
dtype: int64

Index(['서울', '부산', '인천', '대전'], dtype='object')

부산    8000000
서울    9000000
인천    7000000
대전    6000000
dtype: int64

In [58]:
s = pd.Series([9904312,3448737,2890451,2466052], index=['서울','부산','인천','대구'])
s2 = pd.Series({'서울':9631482,'부산':3393191,'인천':2632035,'대전':1490158},index=['부산','서울','인천','대전'])
ds = s - s2
print(ds,'\n')
print(s.values - s2.values,'\n')
print(ds.notnull(),'\n')
print(ds[ds.notnull()],'\n')
rs = (s - s2)/ s2 * 100 #인구 증가율
rs = rs[rs.notnull()]
rs

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

[ 6511121 -6182745   258416   975894]

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [27]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [61]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df[['지역']]

     지역
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [63]:
df[['2010','2015']]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [54]:
type(df[['2010']])

pandas.core.frame.DataFrame

In [57]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2[[2]]

    2
0   2
1   6
2  10

In [13]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] / 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [19]:
df['2015']['서울']

9904312

In [29]:
df[1:3]
# 레코드로만 참조가능(행)

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

In [28]:
df['서울':'부산']

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [31]:
# iloc() integer position을 통해 값을 찾고 label로는 찾을 수 없다
# loc() laber로 값을 찾을 수 있고 interger position으로는 찾을 수 없다.
df.iloc[[0]]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283

In [46]:
test = pd.DataFrame({'A':[1,4,7], 'B':[2,5,8], 'C':[3,6,9]})
test

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
test.loc[[0]]

   A  B  C
0  1  2  3

In [59]:
test.iloc[[0]]

   A  B  C
0  1  2  3

In [61]:
test.loc[:,'A']

0    1
1    4
2    7
Name: A, dtype: int64

In [45]:
test[['A']]

   A
0  1
1  4
2  7

In [58]:
test.loc[0]['B']

2

In [62]:
testtitanic = pd.read_csv('./titanic/train.csv')
testtitanic.iloc[0:5, 1:4]

   Survived  Pclass                                               Name
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

In [63]:
testtitanic[['Name','Age','Sex','Survived']]

                                                  Name   Age     Sex  Survived
0                              Braund, Mr. Owen Harris  22.0    male         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female         1
2                               Heikkinen, Miss. Laina  26.0  female         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female         1
4                             Allen, Mr. William Henry  35.0    male         0
..                                                 ...   ...     ...       ...
886                              Montvila, Rev. Juozas  27.0    male         0
887                       Graham, Miss. Margaret Edith  19.0  female         1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN  female         0
889                              Behr, Mr. Karl Howell  26.0    male         1
890                                Dooley, Mr. Patrick  32.0    male         0

[891 rows x 4 columns]

In [70]:
mask = (testtitanic[['Sex']] == 'female')
testtitanic[mask]
# or mask

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,family
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,female,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,female,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,female,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
887,NaN,NaN,NaN,NaN,female,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
888,NaN,NaN,NaN,NaN,female,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
889,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
890,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [66]:
# 사전 객체처럼 존재하지 않는 키를 사용하면 추가됨
testtitanic['family'] = testtitanic['SibSp'] + testtitanic['Parch']
testtitanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [78]:
testtitanic2 = testtitanic[testtitanic['PassengerId'] == 3][['Name','Fare']]
testtitanic2

                     Name   Fare
2  Heikkinen, Miss. Laina  7.925

# 09-28

In [3]:
df = pd.DataFrame({'A':[1,4,7], 'B':[2,5,8], 'C':[3,6,9]})
df.set_index('A')

   B  C
A
1  2  3
4  5  6
7  8  9

In [15]:
df = pd.DataFrame(data=np.array([[1,2,3],[4,5,6],[7,8,9]]),columns=[48,49,50])
df

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9

In [16]:
a = pd.DataFrame(data=np.array([[1,2,3]]),columns=[48,49,50])
df = df.append(a)
df

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9
0   1   2   3

In [9]:
df2 = df.reset_index(drop=True)
df2

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9
3   1   2   3

In [10]:
df2 = df.set_index(48)
df2

    49  50
48
1    2   3
4    5   6
7    8   9
1    2   3

In [11]:
df = pd.DataFrame(data=np.array([[1,2,3],[4,5,6],[7,8,9]]),columns=['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
df.drop('A', axis=1, inplace=True) #A컬럼 삭제
# df2 = df.drop('A', axis=1)
df

   B  C
0  2  3
1  5  6
2  8  9

In [17]:
df.drop([0,2], axis=0, inplace=True)
df

   48  49  50
1   4   5   6

In [26]:
df = pd.DataFrame(data=np.array([[1,2,3],[4,5,6],[7,8,9],[40,50,60],[23,35,48]]),columns=[48,49,50],index=[2.5,12.6,4.8,4.8,2.5])
df

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
4.8   40  50  60
2.5   23  35  48

In [27]:
df = df.reset_index()
df

   index  48  49  50
0    2.5   1   2   3
1   12.6   4   5   6
2    4.8   7   8   9
3    4.8  40  50  60
4    2.5  23  35  48

In [28]:
df = df.drop_duplicates(subset='index', keep='last').set_index('index')
df

       48  49  50
index
12.6    4   5   6
4.8    40  50  60
2.5    23  35  48

In [33]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [1, 5, 6], [7, 8, 9]]), 
 columns=['A', 'B', 'C'], index=[11,22,33])
print(df,'\n')
print(df.index[1],'\n')
print(df.drop(df.index[1]),'\n')

    A  B  C
11  1  2  3
22  1  5  6
33  7  8  9

22

    A  B  C
11  1  2  3
33  7  8  9

In [38]:
 df1 = pd.DataFrame({
 '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
 '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']},
 columns=['고객번호', '이름'])
    
 df2 = pd.DataFrame({'고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
 '금액': [10000, 20000, 15000, 5000, 100000, 30000]},
columns=['고객번호', '금액'])
 df3 = pd.merge(df1, df2) #inner join

df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [39]:
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [40]:
df3

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [41]:
df3 = pd.merge(df1, df2, how='outer') #outer join
df3

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [43]:
 df1 = pd.DataFrame({'품종': ['setosa', 'setosa', 'virginica', 'virginica'],
 '꽃잎길이': [1.4, 1.3, 1.5, 1.3]}, columns=['품종', '꽃잎길이'])
 df2 = pd.DataFrame({'품종': ['setosa', 'virginica', 'virginica', 'versicolor'],
 '꽃잎너비': [0.4, 0.3, 0.5, 0.3]}, columns=['품종', '꽃잎너비'])
 df3 = pd.merge(df1, df2)
df1

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [44]:
df2

           품종  꽃잎너비
0      setosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3

In [45]:
df3

          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

In [50]:
df1 = pd.DataFrame({ '고객명': ['춘향', '춘향', '몽룡'],
 '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
 '데이터': ['20000', '30000', '100000']})
df2 = pd.DataFrame({ '고객명': ['춘향', '몽룡'],
 '데이터': ['여자', '남자']})
df3 = pd.merge(df1, df2, on='고객명') #이름이 같아도 키가 되면 안되는 열이 있다면 on인수로 기준열을 명시해야됨
#값은 같은데 칼럼이 다를경우(예 df1은 고객명,df2는 성명 이럴경우엔 left_on='고객명',right_on='성명' 이런식으로 해야됨)

df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [51]:
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [52]:
df3

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

In [53]:
df1 = pd.DataFrame({
 '도시': ['서울', '서울', '서울', '부산', '부산'],
 '연도': [2000, 2005, 2010, 2000, 2005],
 '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
df2 = pd.DataFrame(np.arange(12).reshape((6, 2)),
 index=[['부산', '부산', '서울', '서울', '서울', '서울'],
 [2000, 2005, 2000, 2005, 2010, 2015]],
 columns=['데이터1', '데이터2'])
df3 = pd.merge(df1, df2, left_on=['도시', '연도'], right_index=True)

df1

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547

In [54]:
df2

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [55]:
df3

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [69]:
df1 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'],
 columns=['서울', '부산'])
df2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
 index=['b', 'c', 'd', 'e'],
columns=['대구', '광주'])
df3 = pd.merge(df1, df2, how='outer', left_index=True, right_index=True)
df4 = pd.merge(df1, df2, left_index=True, right_index=True)

In [66]:
df1

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [67]:
df2

     대구    광주
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [68]:
df3

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [70]:
df4

    서울   부산    대구    광주
c  3.0  4.0   9.0  10.0
e  5.0  6.0  13.0  14.0

In [82]:
df1 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'],
 columns=['서울', '부산'])
df2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
 index=['b', 'c', 'd', 'e'],
columns=['대구', '광주'])
df3 = df1.join(df2)
df4 = df2.join(df1)
df3

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
c  3.0  4.0   9.0  10.0
e  5.0  6.0  13.0  14.0

In [77]:
df4

     대구    광주   서울   부산
b   7.0   8.0  NaN  NaN
c   9.0  10.0  3.0  4.0
d  11.0  12.0  NaN  NaN
e  13.0  14.0  5.0  6.0

In [86]:
s1 = pd.DataFrame([0, 1], index=['A', 'B'])
s2 = pd.DataFrame([2, 3, 4], index=['A', 'B', 'C'])
s3 = pd.concat([s1, s2])
s1

   0
A  0
B  1

In [87]:
s2

   0
A  2
B  3
C  4

In [88]:
s3

   0
A  0
B  1
A  2
B  3
C  4

In [91]:
s3.reset_index(drop=True)

   0
0  0
1  1
2  2
3  3
4  4

In [92]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
 index=['a', 'b', 'c'], columns=['데이터1', '데이터2'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2),
 index=['a', 'c'], columns=['데이터3', '데이터4'])
df3 = pd.concat([df1, df2], axis=1)

df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [93]:
df2

   데이터3  데이터4
a     5     6
c     7     8

In [94]:
df3

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

## 시계열 데이터

In [101]:
date_str = ["2020/7/1", "2020/7/2", "2020/7/3"]
idx = pd.to_datetime(date_str)
np.random.seed(0)
s = pd.DataFrame(np.random.randn(3), index=idx)
g = pd.DataFrame({'test':[1,2,3]}, index=idx)
g

            test
2020-07-01     1
2020-07-02     2
2020-07-03     3

In [112]:
a = pd.date_range("2020-7-1", "2020-7-30") 
adf = pd.DataFrame(index=a )#columns=a

b = pd.date_range(start="2020-7-1", end="2020-7-30")
bdf = pd.DataFrame(index=b)#columns=a

c = pd.date_range(start="2020-7-1", periods = 7)
cdf = pd.DataFrame(index=c)#columns=a
a

DatetimeIndex(['2020-07-01', '2020-07-02', '2020-07-03', '2020-07-04',
               '2020-07-05', '2020-07-06', '2020-07-07', '2020-07-08',
               '2020-07-09', '2020-07-10', '2020-07-11', '2020-07-12',
               '2020-07-13', '2020-07-14', '2020-07-15', '2020-07-16',
               '2020-07-17', '2020-07-18', '2020-07-19', '2020-07-20',
               '2020-07-21', '2020-07-22', '2020-07-23', '2020-07-24',
               '2020-07-25', '2020-07-26', '2020-07-27', '2020-07-28',
               '2020-07-29', '2020-07-30'],
              dtype='datetime64[ns]', freq='D')

In [103]:
b

DatetimeIndex(['2020-07-01', '2020-07-02', '2020-07-03', '2020-07-04',
               '2020-07-05', '2020-07-06', '2020-07-07', '2020-07-08',
               '2020-07-09', '2020-07-10', '2020-07-11', '2020-07-12',
               '2020-07-13', '2020-07-14', '2020-07-15', '2020-07-16',
               '2020-07-17', '2020-07-18', '2020-07-19', '2020-07-20',
               '2020-07-21', '2020-07-22', '2020-07-23', '2020-07-24',
               '2020-07-25', '2020-07-26', '2020-07-27', '2020-07-28',
               '2020-07-29', '2020-07-30'],
              dtype='datetime64[ns]', freq='D')

In [104]:
c

DatetimeIndex(['2020-07-01', '2020-07-02', '2020-07-03', '2020-07-04',
               '2020-07-05', '2020-07-06', '2020-07-07'],
              dtype='datetime64[ns]', freq='D')

### freq 인수
* s: 초
* T: 분
* H: 시간
* D: 일(day)
* B: 주말이 아닌 평일
* W: 주(일요일)
* W-MON: 주(월요일)
* M: 각 달(month)의 마지막 날
* MS: 각 달의 첫날
* BM: 주말이 아닌 평일 중에서 각 달의 마지막 날
* BMS: 주말이 아닌 평일 중에서 각 달의 첫날
* WOM-2THU: 각 달의 두번째 목요일
* Q-JAN: 각 분기의 첫달의 마지막 날
* Q-DEC: 각 분기의 마지막 달의 마지막 날

In [123]:
a = pd.date_range("2022-1-1", "2022-12-31", freq="W")
b = pd.date_range("2022-1-1", "2022-12-31", freq="W-MON")
c = pd.date_range("2022-1-1", "2022-12-31", freq="B")
d = pd.date_range("2022-1-1", "2022-12-31", freq="MS")
e = pd.date_range("2022-1-1", "2022-12-31", freq="M")
a

DatetimeIndex(['2022-01-02', '2022-01-09', '2022-01-16', '2022-01-23',
               '2022-01-30', '2022-02-06', '2022-02-13', '2022-02-20',
               '2022-02-27', '2022-03-06', '2022-03-13', '2022-03-20',
               '2022-03-27', '2022-04-03', '2022-04-10', '2022-04-17',
               '2022-04-24', '2022-05-01', '2022-05-08', '2022-05-15',
               '2022-05-22', '2022-05-29', '2022-06-05', '2022-06-12',
               '2022-06-19', '2022-06-26', '2022-07-03', '2022-07-10',
               '2022-07-17', '2022-07-24', '2022-07-31', '2022-08-07',
               '2022-08-14', '2022-08-21', '2022-08-28', '2022-09-04',
               '2022-09-11', '2022-09-18', '2022-09-25', '2022-10-02',
               '2022-10-09', '2022-10-16', '2022-10-23', '2022-10-30',
               '2022-11-06', '2022-11-13', '2022-11-20', '2022-11-27',
               '2022-12-04', '2022-12-11', '2022-12-18', '2022-12-25'],
              dtype='datetime64[ns]', freq='W-SUN')

In [124]:
b

DatetimeIndex(['2022-01-03', '2022-01-10', '2022-01-17', '2022-01-24',
               '2022-01-31', '2022-02-07', '2022-02-14', '2022-02-21',
               '2022-02-28', '2022-03-07', '2022-03-14', '2022-03-21',
               '2022-03-28', '2022-04-04', '2022-04-11', '2022-04-18',
               '2022-04-25', '2022-05-02', '2022-05-09', '2022-05-16',
               '2022-05-23', '2022-05-30', '2022-06-06', '2022-06-13',
               '2022-06-20', '2022-06-27', '2022-07-04', '2022-07-11',
               '2022-07-18', '2022-07-25', '2022-08-01', '2022-08-08',
               '2022-08-15', '2022-08-22', '2022-08-29', '2022-09-05',
               '2022-09-12', '2022-09-19', '2022-09-26', '2022-10-03',
               '2022-10-10', '2022-10-17', '2022-10-24', '2022-10-31',
               '2022-11-07', '2022-11-14', '2022-11-21', '2022-11-28',
               '2022-12-05', '2022-12-12', '2022-12-19', '2022-12-26'],
              dtype='datetime64[ns]', freq='W-MON')

In [125]:
c

DatetimeIndex(['2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06',
               '2022-01-07', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14',
               ...
               '2022-12-19', '2022-12-20', '2022-12-21', '2022-12-22',
               '2022-12-23', '2022-12-26', '2022-12-27', '2022-12-28',
               '2022-12-29', '2022-12-30'],
              dtype='datetime64[ns]', length=260, freq='B')

In [126]:
d

DatetimeIndex(['2022-01-01', '2022-02-01', '2022-03-01', '2022-04-01',
               '2022-05-01', '2022-06-01', '2022-07-01', '2022-08-01',
               '2022-09-01', '2022-10-01', '2022-11-01', '2022-12-01'],
              dtype='datetime64[ns]', freq='MS')

In [127]:
e

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-30',
               '2022-05-31', '2022-06-30', '2022-07-31', '2022-08-31',
               '2022-09-30', '2022-10-31', '2022-11-30', '2022-12-31'],
              dtype='datetime64[ns]', freq='M')

## 데이터 파일 입출력

In [135]:
sample1 = pd.read_csv('./sample1.csv')
sample1

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [139]:
sample1 = pd.read_csv('./sample1.csv',index_col='c1')
sample1

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [137]:
sample2 = pd.read_csv('./sample2.csv', names=['c1','c2','c3']) #컬럼없으면 레코드의 1첫번째 데이터가 컬럼으로 들어감
sample2

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [141]:
sample3 = pd.read_table('./sample3.txt',sep='\t')
sample3

         C1        C2        C3       C4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [146]:
sample4 = pd.read_table('./sample4.txt', skiprows=[0, 1], sep=',')
#파일 중에 건너 뛰어야 할 행이 잇으면 skiprows 인수를 사용한다. 0과 1행을 스킵
sample4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [147]:
sample5 = pd.read_csv('sample5.csv', na_values=['누락'])
#특정한 값을 NaN으로 취급하고 싶으면 na_values 인수에 NaN 값으로 취급한 값을 넣는다.

sample5

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [150]:
sample6 = pd.read_csv('sample5-1.txt')

sample6

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [159]:
#csv 파일을 출력할땐 to_csv()를 사용
df = pd.read_csv('./sample5.csv', na_values=['누락'])
df.to_csv('sample6.csv')
df.to_csv('sample7.txt',sep='|')
df.to_csv('sample8.csv', na_rep='누락') #na_rep 인수로 NaN 표시값을 바꿀 수도 잇다.
df.to_csv('sample9.csv', index=False, header=True) #index, header 인수를 지정하여 인덱스 및 헤더 출력 여부를 지정하는 것도 가능하다.

In [160]:
pd.read_csv('./sample6.csv')

   Unnamed: 0   c1    c2      c3
0           0  1.0  1.11     one
1           1  2.0   NaN     two
2           2  NaN  3.33   three

In [161]:
pd.read_csv('./sample7.txt')

       |c1| c2| c3
0  0|1.0|1.11| one
1      1|2.0|| two
2   2||3.33| three

In [162]:
pd.read_csv('./sample8.csv')

   Unnamed: 0   c1    c2      c3
0           0  1.0  1.11     one
1           1  2.0    누락     two
2           2   누락  3.33   three

In [163]:
pd.read_csv('./sample9.csv')

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

### 데이터 정렬
* sort_index()
    * 인덱스 기준 정렬
* sort_values()
    * 컬럼 데이터 기준 정렬
    * 어떤 컬럼의 값을 기준으로 정렬해야 하는지 명시적으로 설정해야되기 때문에, by옵션에 정렬 기준이되는 컬럼명을 지정한다.

## pivot
pandas는 피봇 테이블을 만들기 위한 pivot()을 제공한다

In [2]:
data = {
    '도시': ['서울','서울','서울','부산','부산','부산','인천','인천'],
    '연도': ['2015','2010','2005','2015','2010','2005','2015','2010'],
    '인구': [9904312,961482,9762546,3448737,3393191,3512547,2890451,2632035],
    '지역': ['수도권','수도권','수도권','경상권','경상권','경상권','수도권','수도권']
}
columns = ['도시','연도','인구','지역']
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010   961482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [3]:
df1.pivot('도시','연도','인구') #첫번째 파라미터는 인덱스(행),두번째는 컬럼(열),세번째는 값

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0   961482.0  9904312.0
인천        NaN  2632035.0  2890451.0

## pivot_table
형식)pivot_table(data, values=None,index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, margins_name='All')

* data:분석할 데이터프레임
* values:분석할 데이터프레임에서 분석할 열
* index: 행 인덱스로 들어갈 키 열 또는 키 열의 리스트
* columns: 열 인덱스로 들어갈 키 열 또는 키 열의 리스트
* aggfunc: 분석 메서드 지정
* fill_value: NaN 대체 값 지정
* margins: 오른쪽과 아래에 합계를 붙일지 여부 지정
* margins_name: 합계 열(행)의 이름 지정

In [5]:
df1.pivot_table('인구','연도','지역')

지역          경상권        수도권
연도
2005  3512547.0  9762546.0
2010  3393191.0  1796758.5
2015  3448737.0  6397381.5

In [6]:
df2 = pd.DataFrame({'key1': ['A','A','B','B','A'],
                   'key2': ['one','two','one','two','one'],
                   'data1' : [1,2,3,4,5],
                   'data2' : [10,20,30,40,50]})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [10]:
df2.pivot_table('data1','key1','key2', aggfunc='mean')

key2  one  two
key1
A       3    2
B       3    4

In [11]:
df2.pivot_table('data1','key1','key2', aggfunc='sum')

key2  one  two
key1
A       6    2
B       3    4

In [12]:
df2.pivot_table('data1','key1','key2', aggfunc='sum', margins=True)

key2  one  two  All
key1
A       6    2    8
B       3    4    7
All     9    6   15

In [14]:
df2.pivot_table('data1','key1','key2', aggfunc='mean', margins=True, margins_name='평균')

key2  one  two        평균
key1
A       3    2  2.666667
B       3    4  3.500000
평균      3    3  3.000000

# 타이타닉 데이터프레임
* passengerId: 승객의 아이디
* survived: 생존여부
* Pclass : 승객 등급
* name: 승객 이름
* sex: 성별
* age : 나이
* sibsp : 동승한 배우자와 형제(자매)수
* parch : 동승한 부모님 수와 자식수
* ticket : 티켓 번호
* fare : 운임 요금
* cabin : 객실 구역
* embarked: 어디서 탑승했는지 등에 대한 정보

In [39]:
import pandas as pd
df = pd.read_csv('./titanic/train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
df.head() #상위 5개를 읽어옴

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df.tail() #하위 5개를 읽어옴

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [18]:
df.sample(10) #숫자만큼 무작위 순서로 읽어옴

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S
346,347,1,2,"Smith, Miss. Marion Elsie",female,40.0,0,0,31418,13.0000,NaN,S
646,647,0,3,"Cor, Mr. Liudevit",male,19.0,0,0,349231,7.8958,NaN,S
475,476,0,1,"Clifford, Mr. George Quincy",male,NaN,0,0,110465,52.0000,A14,S
375,376,1,1,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,1,0,PC 17604,82.1708,NaN,C
744,745,1,3,"Stranden, Mr. Juho",male,31.0,0,0,STON/O 2. 3101288,7.9250,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
115,116,0,3,"Pekoniemi, Mr. Edvard",male,21.0,0,0,STON/O 2. 3101294,7.9250,NaN,S
520,521,1,1,"Perreault, Miss. Anne",female,30.0,0,0,12749,93.5000,B73,S
324,325,0,3,"Sage, Mr. George John Jr",male,NaN,8,2,CA. 2343,69.5500,NaN,S

In [19]:
 df.info() #dataFrame에 대한 기본 정보를 요약

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [34]:
df.isna() #결측값을 파악, 값이 None일 경우 True, 값이 정상적으로 채워져있는경우 false를 반환

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [21]:
df.describe() #숫자형 열에 대한 기초 통계를 분석
#총 갯수(count),평균(mean),표준 편차(std),최솟값,최댓값등

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [46]:
df.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [23]:
df.corr() #숫자형 열 간의 상관관계를 구함

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [32]:
df.mean() #평균

C:\Project\AI_Source\AI_01\venv\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [25]:
df.groupby('Survived').mean() #데이터를 그룹별로 집계

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [35]:
df.groupby(['Sex','Survived']).mean()

                 PassengerId    Pclass        Age     SibSp     Parch  \
Sex    Survived
female 0          434.851852  2.851852  25.046875  1.209877  1.037037
       1          429.699571  1.918455  28.847716  0.515021  0.515021
male   0          449.121795  2.476496  31.618056  0.440171  0.207265
       1          475.724771  2.018349  27.276022  0.385321  0.357798

                      Fare
Sex    Survived
female 0         23.024385
       1         51.938573
male   0         21.960993
       1         40.821484

In [36]:
df1 = df.rename({'Name': '이름'}, axis=1)
df1

,PassengerId,Survived,Pclass,이름,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [40]:
df2 = df.rename(columns={'Age':'나이','Name':'이름','Sex':'성별'})
df2

,PassengerId,Survived,Pclass,이름,성별,나이,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [29]:
df3 = df.Sex.map(lambda x: 0 if x == 'female' else 1) #성별이 여자면 0, 남자면 1로 변환
df3

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 891, dtype: int64

In [42]:
def convert_gender(x):
    if x == 'Female':
        return 0
    else:
        return 1
df3 = df.Sex.map(convert_gender)
df3

0      1
1      1
2      1
3      1
4      1
      ..
886    1
887    1
888    1
889    1
890    1
Name: Sex, Length: 891, dtype: int64

In [43]:
def convert_Embarked(x):
    if x == 'C':
        return 0
    elif x == 'Q':
        return 1
    else:
        return 2

df3 = df.Embarked.map(convert_Embarked)
df3

0      2
1      0
2      2
3      2
4      2
      ..
886    2
887    2
888    2
889    0
890    1
Name: Embarked, Length: 891, dtype: int64

In [30]:
def n_square(x,n):
    return x ** n
df4 = df[['Age','SibSp','Fare']].apply(n_square, n=2)
df4

        Age  SibSp         Fare
0     484.0      1    52.562500
1    1444.0      1  5081.308859
2     676.0      0    62.805625
3    1225.0      1  2819.610000
4    1225.0      0    64.802500
..      ...    ...          ...
886   729.0      0   169.000000
887   361.0      0   900.000000
888     NaN      1   549.902500
889   676.0      0   900.000000
890  1024.0      0    60.062500

[891 rows x 3 columns]

In [7]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [169]:
df = pd.read_csv('./titanic/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [170]:
df.sort_index(ascending=False) #내림차순

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S

In [172]:
df2 = df.sort_values(by='Pclass', ascending=False)
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
511,512,0,3,"Webber, Mr. James",male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,S
500,501,0,3,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S
501,502,0,3,"Canavan, Miss. Mary",female,21.0,0,0,364846,7.7500,NaN,Q
502,503,0,3,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,7.6292,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
102,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S
710,711,1,1,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.0,0,0,PC 17482,49.5042,C90,C
711,712,0,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
712,713,1,1,"Taylor, Mr. Elmer Zebley",male,48.0,1,0,19996,52.0000,C126,S
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S

In [177]:
df3 = df.sort_values(by=['Pclass','Sex','Age'], ascending=False)
df3.head(30)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
94,95,0,3,"Coxon, Mr. Daniel",male,59.0,0,0,364500,7.2500,NaN,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
222,223,0,3,"Green, Mr. George Henry",male,51.0,0,0,21440,8.0500,NaN,S
406,407,0,3,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S
631,632,0,3,"Lundahl, Mr. Johan Svensson",male,51.0,0,0,347743,7.0542,NaN,S
482,483,0,3,"Rouse, Mr. Richard Henry",male,50.0,0,0,A/5 3594,8.0500,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
771,772,0,3,"Jensen, Mr. Niels Peder",male,48.0,0,0,350047,7.8542,NaN,S
592,593,0,3,"Elsbury, Mr. William James",male,47.0,0,0,A/5 3902,7.2500,NaN,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
203,204,0,3,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C
129,130,0,3,"Ekstrom, Mr. Johan",male,45.0,0,0,347061,6.9750,NaN,S
338,339,1,3,"Dahl, Mr. Karl Edwart",male,45.0,0,0,7598,8.0500,NaN,S
160,161,0,3,"Cribb, Mr. John Hatfield",male,44.0,0,1,371362,16.1000,NaN,S
414,415,1,3,"Sundman, Mr. Johan Julian",male,44.0,0,0,STON/O 2. 3101269,7.9250,NaN,S
603,604,0,3,"Torber, Mr. Ernst William",male,44.0,0,0,364511,8.0500,NaN,S
696,697,0,3,"Kelly, Mr. James",male,44.0,0,0,363592,8.0500,NaN,S
668,669,0,3,"Cook, Mr. Jacob",male,43.0,0,0,A/5 3536,8.0500,NaN,S
818,819,0,3,"Holm, Mr. John Fredrik Alexander",male,43.0,0,0,C 7075,6.4500,NaN,S
197,198,0,3,"Olsen, Mr. Karl Siegwart Andreas",male,42.0,0,1,4579,8.4042,NaN,S
349,350,0,3,"Dimic, Mr. Jovan",male,42.0,0,0,315088,8.6625,NaN,S
699,700,0,3,"Humblen, Mr. Adolf Mathias Nicolai Olsen",male,42.0,0,0,348121,7.6500,F G63,S
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S
761,762,0,3,"Nirva, Mr. Iisakki Antino Aijo",male,41.0,0,0,SOTON/O2 3101272,7.1250,NaN,S
860,861,0,3,"Hansen, Mr. Claus Peter",male,41.0,2,0,350026,14.1083,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S

In [8]:
df.ndim

2

In [41]:
df['Cabin'] = df['Cabin'].fillna('C000') #결집된 데이터(NaN)를 c000 으로 채워라
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C000,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,C000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,C000,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,C000,Q

# 서울대병원이 만든 위대한 vitaldb

In [47]:
import vitaldb
track_names = ['age']

vf = vitaldb.VitalFile(1, track_names)

samples = vf.to_pandas(track_names, 1/100)

samples.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     0 non-null      float64
dtypes: float64(1)
memory usage: 124.0 bytes